---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Grid..::..Create Method
Grid Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, Arc) | Creates a new radial grid line. |
|  | Create(Document, Line) | Creates a new grid line. |

# See Also

Grid Class

Grid Members

Autodesk.Revit.DB Namespace